absorption
achromatic
adaptation
aerobic
algae
alimentary
allergy
amoeba
amphibian
analogue
anatomy
ancestor
antibody
appendage
aquatic
arboreal
asexual
assimilation
atrophy
auditory
backbone
bacteria
balance
barrier
benign
biology
biome
bisect
botany
branch
breathe
carnivorous
catalyst
cavity
cell
chlorophyll
cholesterol
chromatic
chromosome
cilia
classification
cohesive
collagen
communicable
community
contraction
control
convolution
coronary
cyclic
darwin
deciduous
decomposition
dermis
develop
dichotomous
dietary
differentiation
diffusion
digestion
dinosaur
discipline
displacement
division
dna
dominant
dormant
ecology
ecosystem
ectoplasm
edema
embryo
endangered
endemic
endoskeleton
endothermic
energy
environment
enzyme
epidermis
erosion
essential
estrogen
evolution
exoskeleton
exothermic
extermination
extinct
factor
feedback
fertilization
fetus
fibrillation
filament
fish
fission
flower
food
chain
fossil
function
gamete
gaseous
gastrin
genetics
genome
genus
germ
gestation
gills
grafting
greenhouse
effect
growth
habitat
hemoglobin
herbivore
heredity
heterogeneous
hibernation
hierarchy
homogeneous
hormone
horticulture
host
human
hybrid
immunity
inclusion
incubate
ingestion
inherited
traits
inoculate
inquiry
insoluble
instinct
insulate
insulin
interdependent
invertebrate
involuntary
isolate
isotope
juncture
kinesthesia
kingdom
latitude
leaf
life
cycle
linkage
living
luminescent
lymph
malignant
mammal
marine
meiosis
membrane
memory
metabolism
microbiology
microscope
migration
mildew
molt
muscle
mutation
mutualism
natural
nerve
neuron
nitrogen
nonliving
nucleus
omnivorous
optic
order
organs
osmosis
ossification
oviparous
oxidation
paleontologist
parasite
parasympathetic
pathogen
permeable
photosynthesis
plankton
plasma
platelet
pollen
pollution
portion
predator
preserve
pressure
producer
protein
protoplasm
pulmonary
pyramid
quest
question
radial
receptor
recessive
recycling
reflex
regeneration
regulate
replicate
repress
reptile
residual
resource
respiration
restriction
rh
factor
root
scope
secrete
seed
sensor
shelter
skeleton
skin
solar
spatial
species
specimen
statistics
stimulus
stress
structure
symbiosis
symmetry
synapse
system
taste
taxonomy
tendril
terrestrial
tissue
tolerance
toxin
transformation
transpiration
tundra
turgid
unsaturated
vacuole
variation
ventilate
vertebrate
viable
virus
vital
vitamin
viviparous
volume
voluntary
waste
weather
chromosome
chromosome
zone
zoology
