mutation
mutation
hotspot
somatic
nucleotide
purine
pyrimidine
adenine
guanine
cytosine
thymine
uracil
gene
locus
protein
encoding
control
region
exon
intron
genetic
code
codon
anticodon
redundancy
synonymous
codons
stop
codons
degenerate
position
repeated
sequences
transposable
elements
pseudogene
processed
pseudogene
reverse
transcription
genetic
marker
haplotype
gene
mutations
point
mutation
transition
transversion
synonymous
mutation
frameshift
replication
slippage
meiotic
recombination
intragenic
recombination
gene
conversion
unequal
crossing
over
transposable
elements
insertion
sequence
transposon
retroelement
chromosome
mutations
euploidy
autopolyploidy
allopolyploidy
aneuploidy
inversion
pericentric
paracentric
translocation
fission
fusion
acrocentric
metacentric
neutral
nonsense
missense
silent
neutral
mutation
rate
phenotypic
detection
back
mutation
screening
mutation
accumulation
species
comparison
molecular
clock
constraints
random
deterministic
teleological
allelic
frequencies
ratios
allelic
genotypic
phenotypic
ratios
epigenetic
inheritance
polymorphic
monomorphic
concealed
genetic
variation
fixation
inbreeding
depression
linkage
disequilibrium
electrophoresis
homeotic
mutation
recombination
selection
artificial
selection
natural
selection
directional
selection
selected
for
against
fitness
individual
selection
selection
pressure
adaptation
crypsis
cryptic
stabilizing
selection
disruptive
selection
heterotic
balance
diversifying
selection
balanced
polymorphism
rare
type
advantage
rare
male
advantage
seasonal
selection
niche
partitioning
sexual
selection
male
vs.
female
strategy
mating
systems
monogamy
polygamy
simultaneous
or
sequential
polygyny
polyandry
promiscuity
intrasexual
selection
intersexual
selection
traits
that
are
hinderance
sexual
dimorphism
sex
identification
species
identification
role
partitioning
unselected
consequence
selection
for
viable
mates
courship
dance
handicap
principle
truth
in
advertising
runaway
selection
sexy
son
hypothesis
sexual
selection
and
speciation
sexual
selection
in
humans
individual
selection
kin
selection
inclusive
fitness
index
of
relatedness
altruism
apparent
altruism
eusociality
haplodiploidy
epideictic
display
satellite
males
rb>c
altruism
in
humans
coevolution
coadaptation
sequential
evolution
diffuse
coevolution
guild
interliving
symbiosis
mutualism
predation
parasitism
commensalism
amensalism
competition
adaptive
coloration
adaptive
significance
crypsis
eucrypsis
homochromy
disruptive
coloration
contershading
protective
resemblance
bizarre
pattern
distraction
mechanism
pseudocephalism
shock
pattern
aposematism
advertisement
of
noxiousness
mimicry
pseudaposematism
mimic
model
dupe
behavioral
Batesian
mimicry
olfactory
Batesian
mimicry
synaposematism
aggressive
mimicry
auditory
aggressive
mimicry
olfactory
aggressive
mimicry
pseudocopulation
photomimicry
molecular
mimicry
predator
mimicry
random
phenomena
genetic
drift
effective
population
size
drunkard
walk
founders
effect
bottleneck
effect
neutralist
vs.
selectionist
debate
polymorphic
enzyme
loci
neutral
alleles
small
vs.
large
populations
effectively
neutral
neutral
theory
kv
substitution
rate
null
model
of
mutation
mutation
fraction
of
neutral
mutation
UT
influences
on
neutral
mutation
rate
functional
constraints
base
pair
position
in
codon
population
size
coding
DNA
molecular
clock
time
in
generations
evidence
for
against
neutral
theory
species
biological
species
concept
evolutionary
species
concept
typological
species
concept
speciation
reproductive
isolation
mechanisms
prezygotic
IM
habitat
IM
behavioral
IM
seasonal
IM
morphological
IM
gamete
mortality
postzygotic
IM
zygote
early
mortality
hybrid
inviability
hybrid
sterility
meiotic
failure
abnormal
sperm
hybrid
breakdown
hybrid
floral
isolation
geographic
allopatric
speciation
panmictic
pop.
geographic
barrier
NS
operates
differently
reproductive
isolation
test
of
sympatry
allopatric
allotopic
sympatric
syntopic
dichopatry
parapatry
sister
groups
isolation
on
islands
dumbbell
model
peripheral
isolate
model
parapatric
speciation
clinal
variation
hybrid
zone
sympatric
speciation
allopolyploidy
allophagic
allochronic
other
species
concepts:
evolutionary
morphological
phenetic
phylogenetic
recognition
cohesion
ecological
character
displacement
ecological
reproductive
introgressive
hybridization
sister
species
sibling
species
cryptic
species
adaptive
radiation
geographic
variation
clinal
variation
discontinuous
variation
chaotic
variation
concordant
variation
subspecies
race
semispecies
strain
breed
etc.
intergrade
zone
of
intergradation
subspeciation
monotypic
range
high
vagility
variation
garden
experimient
plasticity
of
test
not
evolutionary
developmental
biology
interdisciplinary
evolution
of
biodiversity
homeotic
genes
homeobox
homeodomain
regulatory
enhancers
spatio-temporal
effects
genetic
model
species
knock
out
gene
transfer
in
situ
hybridization
antibody
detection
reporter
construct
analysis
conserved
vs.
evolved
traits
biological
homology
concept
homologous
analogous
evolutionarily
conserved
pathways
heterochrony
recapitulation
acceleration
hypermophosis
paedomorphosis
progenesis
neoteny
developmental
constraints
antennapedia
colinearity
eon
era
period
epoch
precambrian
first
life
anaerobic
aerobic
cyanobacteria
photosynthesis
microfossils
stromatolites
endosymbiotic
origin
of
eukaryotes
first
multicellular
organisms
systematics
phylogeny
classification
namenclature
taxon
taxa
taxonomic
level
species
genus
genera
family
order
class
phylum
kingdom
domain
sub-
super-
infra-
tribe
reasons
for
differences
divergent
evolution
patterns
of
extinction
extinction
mass
extinction
factors
influencing
likelihood
of
extinction
rates
of
evolution
horotely
bradytely
tachytely
reasons
for
similarity
common
ancestry
convergent
evolution
parallel
evolution
mimicry
homologous
analogous
homoplasy
fossil
record
fossilization
plesiomorphic
apomorphic
symplesiomorphic
synapomorphic
autapomorphic
rule
of
majority
outgroup
comparison
embryological
evidence
dendogram
phylogram
cladogram
phenogram
chronogram
anagenesis
cladogenesis
phenetic
systematics
numerical
taxonomy
cladistic
systematics
evolutionary
systematics
sister
groups
clade
monophyletic
holophyletic
paraphyletic
polyphyletic
hypothetical
taxonomic
unit
rules
of
nomenclature
international
commission
of
zoological
nomenclature
international
commission
of
botanical
nomenclature
code
of
nomenclature
provisions
scope
starting
point
uninomen
binomen
trinomen
availability
synonym
homonym
latin
neolatin
nomen
conservandum
nomina
conservanda
nomen
oblitum
description
tautonym
authorship
nominate
coordinate
categories
patronym
nominate
adjectival
singular
plural
geographical
epithet
revision
rule
of
parsimony
deme
