abrade
acid
aeration
aftershock
alloy
alluvial
alter
alteration
anodize
aquifer
assessment
avalanche
back
reef
bacteria
basin
batholith
bedrock
burning
butte
calcium
calcium
carbonate
carbon
dioxide
carbon
dating
carbonic
acid
carve
cataclysm
cavern
cavities
change
chemical
reaction
chimney
cinder
cone
cirque
classified
climate
changes
clod
collision
compaction
composite
composition
compression
cone
configuration
continent
continental
coral
crag
creep
crevasse
crust
crystals
cycle
dampness
decay
decomposition
delta
dendrite
denude
deposits
depth
detritus
dike
dilute
disaster
discovery
dissolution
dissolve
distance
dome
drainage
earthquake
elements
elevation
eluvium
environment
eolian
epicenter
epoch
erosion
esker
evaporation
examination
exploration
explosion
extinction
extrude
facet
fault
feldspar
fissure
flowstone
fluvial
foliation
force
formations
fossil
fracture
fuel
geode
geodesic
geologic
geologist
geothermal
geyser
glacial
glacier
gravity
grotto
groundwater
guyot
gypsum
hade
honeycombed
horizon
humidity
humus
hyaline
hydrocarbon
hydrogen
sulfide
hydrologic
ice
age
icecap
igneous
illumination
imminent
impact
impassable
inanimate
inquiry
instruments
integrity
intrusive
joint
jurassic
jutting
karst
keen
kettle
lake
landmark
landscape
landslide
launch
lava
layer
leach
lethal
lignite
limestone
lithosphere
lodestone
loess
luminous
luster
magma
mantle
massif
matter
meander
measurements
mesa
metamorphosis
microbe
migration
millennia
minerals
moisture
molten
monograph
monolith
mosaic
movement
nubbin
numerous
oasis
objects
obsidian
official
oolites
cave
pearls
organic
outcropping
outwash
plain
oxygen
paleoclimates
paleontologist
passageways
percolate
permafrost
permian
petrified
petrify
petrographer
physical
plate
plateau
playa
porous
precipitation
prediction
pressure
pristine
probe
prospecting
quarry
quartz
quest
questions
quit
ratios
reef
residual
richter
scale
rift
rill
rimrock
rivers
rocks
rockslide
rubble
runoff
salt
sandstone
saturation
schist
scientific
scree
sculpt
sedimentary
seepage
seismic
shale
shard
shelf
shelf
stone
shift
slag
slope
slurry
soil
speleologist
spew
stalactite
stalagmites
stone
stratification
subterranean
sulfuric
acid
talus
tectonic
thermals
thrust
tilt
topography
trail
head
triassic
tundra
underground
unearth
unique
unity
universal
upheaval
upstream
vapor
vein
vent
ventifact
vitreous
volcano
volume
waterfalls
weathering
wonder
worldwide
zealous
zero
impact
zest
zigzag
zone
