abiosis
abrade
absorption
acceleration
accumulation
acid
acidic
activist
adaptation
agonistic
agrarian
airborne
alchemist
alignment
allele
alluvial
alveoli
ambiparous
amphibian
amplitude
analysis
ancestor
anodize
anomaly
anther
antigen
apiary
apparatus
application
approximation
aquatic
aquifer
arboreal
archeology
artery
assessment
asteroid
atmosphere
atomic
atrophy
attenuate
aven
aviary
axis
bacteria
balance
bases
biome
biosphere
black
hole
blight
buoyancy
calcium
canopy
capacity
capillary
carapace
carcinogen
catalyst
cauldron
celestial
cells
centigrade
centimeter
centrifugal
chemical
reaction
chemicals
chemistry
chlorophyll
choked
chromosome
chronic
churn
classification
climate
cloud
comet
composition
compound
compression
condensation
conditions
conduction
conductivity
conservation
constant
constellation
continental
convection
convention
cool
core
cosmic
crater
creature
crystals
cycle
cytoplasm
dampness
data
decay
decibel
deciduous
defoliate
density
denude
dependency
deposits
depth
desiccant
detritus
development
digestible
dilute
direction
disappearance
discovery
dislodge
displace
dissection
dissolution
dissolve
distance
diurnal
diverse
doldrums
dynamics
earthquake
eclipse
ecology
ecosystem
electricity
elements
elevation
embryo
endangered
endocrine
energy
entropy
environment
enzyme
epidermis
epoch
equilibrium
equine
erosion
essential
estuary
ethical
evaporation
event
evidence
evolution
examination
existence
expansion
experiment
exploration
extinction
extreme
facet
fault
fauna
feldspar
ferment
fission
fissure
flora
flourish
flowstone
foliage
food
chain
forage
force
forecast
forensics
formations
fossil
fuel
frequency
friction
fungi
fusion
galaxy
gastric
geo-science
geothermal
germination
gestation
global
gravitation
green
greenhouse
effect
grotto
groundwater
habitat
heat
heavens
hemisphere
hemoglobin
herpetologist
hormones
host
humidity
hyaline
hydrogen
hydrology
hypothesis
ichthyology
illumination
imagination
impact
impulse
incandescent
indigenous
inertia
inevitable
inherit
inquiry
insoluble
instinct
instruments
integrity
intelligence
interact
interdependence
interplanetary
invertebrate
investigation
invisible
ions
irradiate
isobar
isotope
joule
jungle
jurassic
jutting
kilometer
kinetics
kingdom
knot
laser
latitude
lava
lethal
life
lift
light
limestone
lipid
lithosphere
load
lodestone
luminous
luster
magma
magnet
magnetism
mangrove
mantle
marine
marsh
mass
matter
measurements
mechanical
meiosis
meridian
metamorphosis
meteor
microbes
microcosm
migration
millennia
minerals
modulate
moisture
molecule
molten
monograph
monolith
motion
movement
mutant
mutation
mysterious
natural
navigable
navigation
negligence
nervous
system
nesting
neutrons
niche
nocturnal
nuclear
energy
numerous
nurture
obsidian
ocean
oceanography
omnivorous
oolites
cave
pearls
opaque
orbit
organ
organism
ornithology
osmosis
oxygen
paleontologist
parallax
particle
penumbra
percolate
permafrost
permutation
petrify
petrograph
phenomena
physical
property
planetary
plasma
polar
pole
pollination
polymer
population
precipitation
predator
prehensile
preservation
preserve
pressure
primate
pristine
probe
process
propagation
properties
protected
proton
pulley
qualitative
data
quantum
quark
quarry
radiation
radioactivity
rain
forest
ratio
reaction
reagent
realm
redwoods
reeds
reflection
refraction
relationships
reptile
research
resistance
resonate
rookery
rubble
runoff
salinity
sandbar
satellite
saturation
scientific
investigation
scientist
sea
floor
season
sedentary
sediment
sedimentary
seepage
seismic
sensors
shard
similarity
solar
soluble
solvent
sonic
sound
source
species
spectacular
spectrum
speed
sphere
spring
stage
stalactite
stalagmites
stimulus
substance
subterranean
sulfuric
acid
surface
survival
swamp
sylvan
symbiosis
symbol
synergy
synthesis
taiga
taxidermy
technology
tectonics
temperate
temperature
terrestrial
thermals
thermometer
thrust
torque
toxin
trade
winds
transformation
tremors
tropical
umbra
unbelievable
underwater
unearth
unique
unite
unity
universal
unpredictable
unusual
ursine
vacuole
valuable
vapor
variable
variety
vast
velocity
ventifact
verdant
vespiary
viable
vibration
virus
viscosity
visible
vista
vital
vitreous
volt
volume
vulpine
wave
wax
weather
westerlies
wetlands
whitewater
xeriscape
xylem
yield
zero-impact
zone
zygote
